[
  {
    "id": "2026-03-01-group-by-leads",
    "date": "2026-03-01",
    "title": "Matchup Planner: Group By Leads",
    "message": "New toggle on the Matchup Planner page! You can now group your strategy plans by lead pairs to quickly see which leads cover the most matchups. Hit the 'Group By Leads' button to try it out."
  },
  {
    "id": "2026-02-26-calc-matchup-stats",
    "date": "2026-02-26",
    "title": "Calc and Matchup Stat Fixes",
    "message": "A couple of fixes went out on the calculator (proper Stellar handling, formes had missing stats, IVs would persist among slots). The Matchup Stats page also now accepts formes in the custom analysis (very overdue). As a reminder, details on sprites not loading can be seen in the previous announcements, link in the footer."
  },
  {
    "id": "2026-02-24-matchup-fixes",
    "date": "2026-02-24",
    "title": "Matchup Planner Fixes",
    "message": "The Matchup Planner page has been refactored a bit, should be more usable in mobile now. As a reminder, details on sprites not loading can be seen in the previous announcement, link in the footer."
  },
  {
    "id": "2026-02-23-clear-cache",
    "date": "2026-02-23",
    "title": "Sprite Loading Issue",
    "message": "As there's been a lot of churn with the frequent releases, it's likely that the image cache in your browser has been invalidated. If you don't see sprites loading, try clearing your browser cache. In Chrome: Settings > Privacy and security > Delete browsing data > Cached images and files (select all time). In Safari: Settings > Privacy > Manage Website Data... > Find vsrecorder.app and remove it. In both cases be careful NOT to delete cookies browserwide, or say goodbye to your Showdown teams... (Not needed for this, but you can save off all of your sd teams at the very end of the team builder, simply copy paste to a text file and save it off periodically somewhere safe (like a Google Drive). Sprites should work from now on."
  },
  {
    "id": "2026-02-22-type-chart",
    "date": "2026-02-22",
    "title": "New Page: Type Chart",
    "message": "A new page has been added to the Team sidebar: Type Chart! This page will allow you to see at a glance weaknesses and resistances for your team, while accounting for Abilities as well."
  },
  {
    "id": "2026-02-21-new-features",
    "date": "2026-02-21",
    "title": "New Enhancements: Announcement Alerts, Team Folders, Match by Match tweaks",
    "message": "Welcome to VS Recorder! I've added this announcement alert so that you don't have to follow socials to get new info. Feel free to check the footer for a link to past announcements (this is the real first one though). As for new features: Team Folders! You can create/delete folders, drag teams into folders to organize them (drag them out to Home or simply hit that X button on the team to remove them), and you should also see the latest modified team as the first one listed. You can also order folders by dragging them around. I've also updated the Match by Match page: picks for you and your opponent will be displayed, the filter has been enhanced to find tags and users, and it should also be a bit more mobile friendly."
  },
  {
    "id": "2026-01-01-announcements-page",
    "date": "2026-01-01",
    "title": "Announcements Page",
    "message": "You can now stay up to date with VS Recorder news right from the app. Check the Announcements link in the footer to see past and future updates."
  }
]
